sgw-sms-sender-example.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <smsi:sendSMS xmlns:enae="http://com.osa.mdsp.enabler.ecf" xmlns:smsi="http://com.osa.mdsp.enabler.sei/SMSEnabler/V2_0/SMSSenderSEI" xmlns:smst="http://com.osa.mdsp.enabler.sei.eto/SMSEnabler/V2_0">
      <smsi:sms>
        <smst:content>TEST</smst:content>
        <smst:recipient>507998000</smst:recipient>
      </smsi:sms>
    </smsi:sendSMS>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
